## Production: api
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 23 to add, 0 to change, 2 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                                                NAME                                                 |
|--------|-----------------------------------------------------------------------------------------------------|
| add    | `aws_cloudwatch_log_subscription_filter.api_request`                                                |
|        | `aws_lambda_function_url.url_shortener_url`                                                         |
|        | `aws_ssm_parameter.auth_token_app`                                                                  |
|        | `aws_ssm_parameter.auth_token_notify`                                                               |
|        | `aws_ssm_parameter.cloudfront_header`                                                               |
|        | `aws_ssm_parameter.hashing_peppers`                                                                 |
|        | `aws_ssm_parameter.notify_api_key`                                                                  |
|        | `aws_ssm_parameter.notify_contact_email`                                                            |
|        | `module.sentinel_forwarder.aws_cloudwatch_log_group.sentinel_forwarder_lambda`                      |
|        | `module.sentinel_forwarder.aws_iam_policy.sentinel_forwarder_lambda`                                |
|        | `module.sentinel_forwarder.aws_iam_role.sentinel_forwarder_lambda`                                  |
|        | `module.sentinel_forwarder.aws_iam_role_policy_attachment.sentinel_forwarder_lambda`                |
|        | `module.sentinel_forwarder.aws_lambda_function.sentinel_forwarder`                                  |
|        | `module.sentinel_forwarder.aws_lambda_permission.sentinel_forwarder_cloudwatch_log_subscription[0]` |
|        | `module.url_shortener_lambda.aws_cloudwatch_log_group.this`                                         |
|        | `module.url_shortener_lambda.aws_iam_policy.policies[0]`                                            |
|        | `module.url_shortener_lambda.aws_iam_policy.vpc_policies[0]`                                        |
|        | `module.url_shortener_lambda.aws_iam_role.this`                                                     |
|        | `module.url_shortener_lambda.aws_iam_role_policy_attachment.AWSLambdaVPCAccessExecutionRole[0]`     |
|        | `module.url_shortener_lambda.aws_iam_role_policy_attachment.attachments[0]`                         |
|        | `module.url_shortener_lambda.aws_iam_role_policy_attachment.lambda_insights[0]`                     |
|        | `module.url_shortener_lambda.aws_iam_role_policy_attachment.vpc_policies[0]`                        |
|        | `module.url_shortener_lambda.aws_lambda_function.this`                                              |
| delete | `aws_iam_role_policy_attachment.admin`                                                              |
|        | `module.gh_oidc_roles.aws_iam_role.this[&quot;OIDCGithubWorkflowRole&quot;]`                                  |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  - destroy
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.api_policies will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "api_policies" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "dynamodb:DeleteItem",
              + "dynamodb:DescribeTable",
              + "dynamodb:GetItem",
              + "dynamodb:PutItem",
              + "dynamodb:Query",
              + "dynamodb:UpdateItem",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:dynamodb:ca-central-1:806721586252:table/",
              + "arn:aws:dynamodb:ca-central-1:806721586252:table//index/emailIndex",
            ]
        }
      + statement {
          + actions   = [
              + "ssm:GetParameters",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
              + (known after apply),
              + (known after apply),
              + (known after apply),
              + (known after apply),
              + (known after apply),
            ]
        }
    }

  # aws_cloudwatch_log_subscription_filter.api_request will be created
  + resource "aws_cloudwatch_log_subscription_filter" "api_request" {
      + destination_arn = (known after apply)
      + distribution    = "Random"
      + filter_pattern  = "?INFO ?WARNING ?ERROR"
      + id              = (known after apply)
      + log_group_name  = "/aws/lambda/url-shortener-api"
      + name            = "API request"
      + role_arn        = (known after apply)
    }

  # aws_iam_role_policy_attachment.admin will be destroyed
  # (because aws_iam_role_policy_attachment.admin is not in configuration)
  - resource "aws_iam_role_policy_attachment" "admin" {
      - id         = "OIDCGithubWorkflowRole-20230131225831523000000001" -> null
      - policy_arn = "arn:aws:iam::aws:policy/AdministratorAccess" -> null
      - role       = "OIDCGithubWorkflowRole" -> null
    }

  # aws_lambda_function_url.url_shortener_url will be created
  + resource "aws_lambda_function_url" "url_shortener_url" {
      + authorization_type = "NONE"
      + function_arn       = (known after apply)
      + function_name      = "url-shortener-api"
      + function_url       = (known after apply)
      + id                 = (known after apply)
      + url_id             = (known after apply)
    }

  # aws_ssm_parameter.auth_token_app will be created
  + resource "aws_ssm_parameter" "auth_token_app" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "auth_token_app"
      + tags           = {
          + "CostCentre" = "url-shortener-production"
          + "Terraform"  = "true"
        }
      + tags_all       = {
          + "CostCentre" = "url-shortener-production"
          + "Terraform"  = "true"
        }
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # aws_ssm_parameter.auth_token_notify will be created
  + resource "aws_ssm_parameter" "auth_token_notify" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "auth_token_notify"
      + tags           = {
          + "CostCentre" = "url-shortener-production"
          + "Terraform"  = "true"
        }
      + tags_all       = {
          + "CostCentre" = "url-shortener-production"
          + "Terraform"  = "true"
        }
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # aws_ssm_parameter.cloudfront_header will be created
  + resource "aws_ssm_parameter" "cloudfront_header" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "cloudfront_header"
      + tags           = {
          + "CostCentre" = "url-shortener-production"
          + "Terraform"  = "true"
        }
      + tags_all       = {
          + "CostCentre" = "url-shortener-production"
          + "Terraform"  = "true"
        }
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # aws_ssm_parameter.hashing_peppers will be created
  + resource "aws_ssm_parameter" "hashing_peppers" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "hashing_peppers"
      + tags           = {
          + "CostCentre" = "url-shortener-production"
          + "Terraform"  = "true"
        }
      + tags_all       = {
          + "CostCentre" = "url-shortener-production"
          + "Terraform"  = "true"
        }
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # aws_ssm_parameter.notify_api_key will be created
  + resource "aws_ssm_parameter" "notify_api_key" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "notify_api_key"
      + tags           = {
          + "CostCentre" = "url-shortener-production"
          + "Terraform"  = "true"
        }
      + tags_all       = {
          + "CostCentre" = "url-shortener-production"
          + "Terraform"  = "true"
        }
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # aws_ssm_parameter.notify_contact_email will be created
  + resource "aws_ssm_parameter" "notify_contact_email" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "notify_contact_email"
      + tags           = {
          + "CostCentre" = "url-shortener-production"
          + "Terraform"  = "true"
        }
      + tags_all       = {
          + "CostCentre" = "url-shortener-production"
          + "Terraform"  = "true"
        }
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # module.gh_oidc_roles.aws_iam_role.this["OIDCGithubWorkflowRole"] will be destroyed
  # (because aws_iam_role.this is not in configuration)
  - resource "aws_iam_role" "this" {
      - arn                   = "arn:aws:iam::806721586252:role/OIDCGithubWorkflowRole" -> null
      - assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRoleWithWebIdentity"
                      - Condition = {
                          - StringLike = {
                              - "token.actions.githubusercontent.com:sub" = [
                                  - "repo:cds-snc/url-shortener:*",
                                ]
                            }
                        }
                      - Effect    = "Allow"
                      - Principal = {
                          - Federated = "arn:aws:iam::806721586252:oidc-provider/token.actions.githubusercontent.com"
                        }
                      - Sid       = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - create_date           = "2023-01-31T22:58:30Z" -> null
      - force_detach_policies = false -> null
      - id                    = "OIDCGithubWorkflowRole" -> null
      - managed_policy_arns   = [
          - "arn:aws:iam::aws:policy/AdministratorAccess",
        ] -> null
      - max_session_duration  = 3600 -> null
      - name                  = "OIDCGithubWorkflowRole" -> null
      - path                  = "/" -> null
      - tags                  = {
          - "CostCentre" = "url-shortener-production"
          - "Terraform"  = "true"
        } -> null
      - tags_all              = {
          - "CostCentre" = "url-shortener-production"
          - "Terraform"  = "true"
        } -> null
      - unique_id             = "AROA3XVC2QRGCTTGHJREF" -> null
    }

  # module.sentinel_forwarder.data.aws_iam_policy_document.sentinel_forwarder_lambda will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "sentinel_forwarder_lambda" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "logs:CreateLogStream",
              + "logs:PutLogEvents",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "xray:GetSamplingRules",
              + "xray:GetSamplingStatisticSummaries",
              + "xray:GetSamplingTargets",
              + "xray:PutTelemetryRecords",
              + "xray:PutTraceSegments",
            ]
          + effect    = "Allow"
          + resources = [
              + "*",
            ]
        }
    }

  # module.sentinel_forwarder.aws_cloudwatch_log_group.sentinel_forwarder_lambda will be created
  + resource "aws_cloudwatch_log_group" "sentinel_forwarder_lambda" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/aws/lambda/sentinel-cloudwatch-forwarder"
      + name_prefix       = (known after apply)
      + retention_in_days = 14
      + skip_destroy      = false
      + tags              = {
          + "CostCentre" = "url-shortener-production"
        }
      + tags_all          = {
          + "CostCentre" = "url-shortener-production"
        }
    }

  # module.sentinel_forwarder.aws_iam_policy.sentinel_forwarder_lambda will be created
  + resource "aws_iam_policy" "sentinel_forwarder_lambda" {
      + arn       = (known after apply)
      + id        = (known after apply)
      + name      = "SentinelForwarderLambda-sentinel-cloudwatch-forwarder"
      + path      = "/"
      + policy    = (known after apply)
      + policy_id = (known after apply)
      + tags_all  = (known after apply)
    }

  # module.sentinel_forwarder.aws_iam_role.sentinel_forwarder_lambda will be created
  + resource "aws_iam_role" "sentinel_forwarder_lambda" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "SentinelForwarderLambda-sentinel-cloudwatch-forwarder"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.sentinel_forwarder.aws_iam_role_policy_attachment.sentinel_forwarder_lambda will be created
  + resource "aws_iam_role_policy_attachment" "sentinel_forwarder_lambda" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "SentinelForwarderLambda-sentinel-cloudwatch-forwarder"
    }

  # module.sentinel_forwarder.aws_lambda_function.sentinel_forwarder will be created
  + resource "aws_lambda_function" "sentinel_forwarder" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + description                    = "Lambda function to forward AWS logs to Azure Sentinel"
      + filename                       = "/tmp/sentinel_forwarder.py.zip"
      + function_name                  = "sentinel-cloudwatch-forwarder"
      + handler                        = "sentinel_forwarder.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + layers                         = [
          + "arn:aws:lambda:ca-central-1:283582579564:layer:aws-sentinel-connector-layer:54",
        ]
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.9"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + source_code_hash               = "liR4yJNhp6SJtCjkSwnH0xGC0q00Uxebs1Cyqv8JLDw="
      + source_code_size               = (known after apply)
      + tags                           = {
          + "CostCentre" = "url-shortener-production"
        }
      + tags_all                       = {
          + "CostCentre" = "url-shortener-production"
        }
      + timeout                        = 30
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "CUSTOMER_ID" = (sensitive value)
              + "LOG_TYPE"    = "ApplicationLog"
              + "SHARED_KEY"  = (sensitive value)
            }
        }

      + ephemeral_storage {
          + size = (known after apply)
        }

      + tracing_config {
          + mode = "Active"
        }
    }

  # module.sentinel_forwarder.aws_lambda_permission.sentinel_forwarder_cloudwatch_log_subscription[0] will be created
  + resource "aws_lambda_permission" "sentinel_forwarder_cloudwatch_log_subscription" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "sentinel-cloudwatch-forwarder"
      + id                  = (known after apply)
      + principal           = "logs.ca-central-1.amazonaws.com"
      + source_arn          = "arn:aws:logs:ca-central-1:806721586252:log-group:/aws/lambda/url-shortener-api:*"
      + statement_id        = "AllowExecutionFromCloudWatchLogs-sentinel-cloudwatch-forwarder-0"
      + statement_id_prefix = (known after apply)
    }

  # module.url_shortener_lambda.aws_cloudwatch_log_group.this will be created
  + resource "aws_cloudwatch_log_group" "this" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/aws/lambda/url-shortener-api"
      + name_prefix       = (known after apply)
      + retention_in_days = 14
      + skip_destroy      = false
      + tags              = {
          + "CostCentre" = "url-shortener-production"
          + "Terraform"  = "true"
        }
      + tags_all          = {
          + "CostCentre" = "url-shortener-production"
          + "Terraform"  = "true"
        }
    }

  # module.url_shortener_lambda.aws_iam_policy.policies[0] will be created
  + resource "aws_iam_policy" "policies" {
      + arn       = (known after apply)
      + id        = (known after apply)
      + name      = "url-shortener-api-0"
      + path      = "/"
      + policy    = (known after apply)
      + policy_id = (known after apply)
      + tags      = {
          + "CostCentre" = "url-shortener-production"
          + "Terraform"  = "true"
        }
      + tags_all  = {
          + "CostCentre" = "url-shortener-production"
          + "Terraform"  = "true"
        }
    }

  # module.url_shortener_lambda.aws_iam_policy.vpc_policies[0] will be created
  + resource "aws_iam_policy" "vpc_policies" {
      + arn       = (known after apply)
      + id        = (known after apply)
      + name      = "url-shortener-api_vpc"
      + path      = "/"
      + policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "ecr:GetDownloadUrlForlayer",
                          + "ecr:BatchGetImage",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:ecr:ca-central-1:806721586252:repository/url-shortener/api"
                      + Sid      = "ECRImageAccess"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id = (known after apply)
      + tags      = {
          + "CostCentre" = "url-shortener-production"
          + "Terraform"  = "true"
        }
      + tags_all  = {
          + "CostCentre" = "url-shortener-production"
          + "Terraform"  = "true"
        }
    }

  # module.url_shortener_lambda.aws_iam_role.this will be created
  + resource "aws_iam_role" "this" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "url-shortener-api"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "CostCentre" = "url-shortener-production"
          + "Terraform"  = "true"
        }
      + tags_all              = {
          + "CostCentre" = "url-shortener-production"
          + "Terraform"  = "true"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.url_shortener_lambda.aws_iam_role_policy_attachment.AWSLambdaVPCAccessExecutionRole[0] will be created
  + resource "aws_iam_role_policy_attachment" "AWSLambdaVPCAccessExecutionRole" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AWSLambdaVPCAccessExecutionRole"
      + role       = "url-shortener-api"
    }

  # module.url_shortener_lambda.aws_iam_role_policy_attachment.attachments[0] will be created
  + resource "aws_iam_role_policy_attachment" "attachments" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "url-shortener-api"
    }

  # module.url_shortener_lambda.aws_iam_role_policy_attachment.lambda_insights[0] will be created
  + resource "aws_iam_role_policy_attachment" "lambda_insights" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/CloudWatchLambdaInsightsExecutionRolePolicy"
      + role       = "url-shortener-api"
    }

  # module.url_shortener_lambda.aws_iam_role_policy_attachment.vpc_policies[0] will be created
  + resource "aws_iam_role_policy_attachment" "vpc_policies" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "url-shortener-api"
    }

  # module.url_shortener_lambda.aws_lambda_function.this will be created
  + resource "aws_lambda_function" "this" {
      + architectures                  = [
          + "x86_64",
        ]
      + arn                            = (known after apply)
      + function_name                  = "url-shortener-api"
      + id                             = (known after apply)
      + image_uri                      = "806721586252.dkr.ecr.ca-central-1.amazonaws.com/url-shortener/api:latest"
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 3008
      + package_type                   = "Image"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags                           = {
          + "CostCentre" = "url-shortener-production"
          + "Terraform"  = "true"
        }
      + tags_all                       = {
          + "CostCentre" = "url-shortener-production"
          + "Terraform"  = "true"
        }
      + timeout                        = 300
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "ALLOWED_DOMAINS"            = "canada.ca,gc.ca,cds-snc.ca"
              + "NOTIFY_CONTACT_TEMPLATE"    = "47a6be8d-c472-426e-81bb-af1bb89aca87"
              + "NOTIFY_MAGIC_LINK_TEMPLATE" = "092f910a-c3cd-4a91-901d-a2d93fe1e603"
              + "SHORTENER_DOMAIN"           = "https://o.alpha.canada.ca/"
              + "SHORTENER_PATH_LENGTH"      = "8"
            }
        }

      + ephemeral_storage {
          + size = 512
        }

      + tracing_config {
          + mode = "PassThrough"
        }

      + vpc_config {
          + security_group_ids = [
              + "",
            ]
          + subnet_ids         = [
              + "",
            ]
          + vpc_id             = (known after apply)
        }
    }

Plan: 23 to add, 0 to change, 2 to destroy.

Changes to Outputs:
  + function_arn  = (known after apply)
  + function_name = "url-shortener-api"
  + function_url  = (known after apply)
  + invoke_arn    = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"
Releasing state lock. This may take a few moments...

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["module.sentinel_forwarder.aws_cloudwatch_log_group.sentinel_forwarder_lambda"]
WARN - plan.json - main - Missing Common Tags: ["module.sentinel_forwarder.aws_iam_policy.sentinel_forwarder_lambda"]
WARN - plan.json - main - Missing Common Tags: ["module.sentinel_forwarder.aws_iam_role.sentinel_forwarder_lambda"]
WARN - plan.json - main - Missing Common Tags: ["module.sentinel_forwarder.aws_lambda_function.sentinel_forwarder"]

21 tests, 17 passed, 4 warnings, 0 failures, 0 exceptions

```

</details>
